zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/periph4/PERI_DMA.h
/*
** ###################################################################
**     Processors:          MCXA286VASR
**                          MCXA286VLL
**                          MCXA286VLQ
**                          MCXA286VPN
**                          MCXA287VASR
**                          MCXA287VLL
**                          MCXA287VLQ
**                          MCXA287VPN
**                          MCXA456VASR
**                          MCXA456VLL
**                          MCXA456VLQ
**                          MCXA456VPN
**                          MCXA457VASR
**                          MCXA457VLL
**                          MCXA457VLQ
**                          MCXA457VPN
**                          MCXA536VLL
**                          MCXA536VLQ
**                          MCXA536VPN
**                          MCXA537VLL
**                          MCXA537VLQ
**                          MCXA537VPN
**                          MCXA556BVPN
**                          MCXA556VPN
**                          MCXA557BVPN
**                          MCXA557VPN
**                          MCXA566VLL
**                          MCXA566VLQ
**                          MCXA566VPN
**                          MCXA567VLL
**                          MCXA567VLQ
**                          MCXA567VPN
**                          MCXA577VLL
**                          MCXA577VLQ
**                          MCXA577VPN
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b260708
**
**     Abstract:
**         CMSIS Peripheral Access Layer for DMA
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2024-03-26)
**         Initial version based on Rev1 DraftC RM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_DMA.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for DMA
 *
 * CMSIS Peripheral Access Layer for DMA
 */

#if !defined(PERI_DMA_H_)
#define PERI_DMA_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXA286VASR) || defined(CPU_MCXA286VLL) || defined(CPU_MCXA286VLQ) || defined(CPU_MCXA286VPN))
#include "MCXA286_COMMON.h"
#elif (defined(CPU_MCXA287VASR) || defined(CPU_MCXA287VLL) || defined(CPU_MCXA287VLQ) || defined(CPU_MCXA287VPN))
#include "MCXA287_COMMON.h"
#elif (defined(CPU_MCXA456VASR) || defined(CPU_MCXA456VLL) || defined(CPU_MCXA456VLQ) || defined(CPU_MCXA456VPN))
#include "MCXA456_COMMON.h"
#elif (defined(CPU_MCXA457VASR) || defined(CPU_MCXA457VLL) || defined(CPU_MCXA457VLQ) || defined(CPU_MCXA457VPN))
#include "MCXA457_COMMON.h"
#elif (defined(CPU_MCXA536VLL) || defined(CPU_MCXA536VLQ) || defined(CPU_MCXA536VPN))
#include "MCXA536_COMMON.h"
#elif (defined(CPU_MCXA537VLL) || defined(CPU_MCXA537VLQ) || defined(CPU_MCXA537VPN))
#include "MCXA537_COMMON.h"
#elif (defined(CPU_MCXA556BVPN) || defined(CPU_MCXA556VPN))
#include "MCXA556_COMMON.h"
#elif (defined(CPU_MCXA557BVPN) || defined(CPU_MCXA557VPN))
#include "MCXA557_COMMON.h"
#elif (defined(CPU_MCXA566VLL) || defined(CPU_MCXA566VLQ) || defined(CPU_MCXA566VPN))
#include "MCXA566_COMMON.h"
#elif (defined(CPU_MCXA567VLL) || defined(CPU_MCXA567VLQ) || defined(CPU_MCXA567VPN))
#include "MCXA567_COMMON.h"
#elif (defined(CPU_MCXA577VLL) || defined(CPU_MCXA577VLQ) || defined(CPU_MCXA577VPN))
#include "MCXA577_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Mapping Information
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Mapping_Information Mapping Information
 * @{
 */

/** Mapping Information */
#if !defined(DMA_REQUEST_SOURCE_T_)
#define DMA_REQUEST_SOURCE_T_
/*!
 * @addtogroup dma_request
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*!
 * @brief Structure for the DMA hardware request
 *
 * Defines the structure for the DMA hardware request collections. The user can configure the
 * hardware request to trigger the DMA transfer accordingly. The index
 * of the hardware request varies according  to the to SoC.
 */
typedef enum _dma_request_source
{
    kDma1RequestDisabled            = 0U,          /**< Disabled */
    kDma0RequestDisabled            = 0U,          /**< Disabled */
    kDma1RequestWUU0                = 1U,          /**< WUU Wake up event */
    kDma0RequestWUU0                = 1U,          /**< WUU Wake up event */
    kDma1RequestMuxFlexCan0DmaRequest = 2U,        /**< CAN0 DMA request */
    kDma0RequestMuxFlexCan0DmaRequest = 2U,        /**< CAN0 DMA request */
    kDma1RequestLPI2C2Rx            = 3U,          /**< LPI2C2 Receive request */
    kDma0RequestLPI2C2Rx            = 3U,          /**< LPI2C2 Receive request */
    kDma1RequestLPI2C2Tx            = 4U,          /**< LPI2C2 Transmit request */
    kDma0RequestLPI2C2Tx            = 4U,          /**< LPI2C2 Transmit request */
    kDma1RequestLPI2C3Rx            = 5U,          /**< LPI2C3 Receive request */
    kDma0RequestLPI2C3Rx            = 5U,          /**< LPI2C3 Receive request */
    kDma1RequestLPI2C3Tx            = 6U,          /**< LPI2C3 Transmit request */
    kDma0RequestLPI2C3Tx            = 6U,          /**< LPI2C3 Transmit request */
    kDma1RequestMuxI3c0Rx           = 7U,          /**< I3C0 Receive request */
    kDma0RequestMuxI3c0Rx           = 7U,          /**< I3C0 Receive request */
    kDma1RequestMuxI3c0Tx           = 8U,          /**< I3C0 Transmit request */
    kDma0RequestMuxI3c0Tx           = 8U,          /**< I3C0 Transmit request */
    kDma1RequestMuxI3c1Rx           = 9U,          /**< I3C1 Receive request */
    kDma0RequestMuxI3c1Rx           = 9U,          /**< I3C1 Receive request */
    kDma1RequestMuxI3c1Tx           = 10U,         /**< I3C1 Transmit request */
    kDma0RequestMuxI3c1Tx           = 10U,         /**< I3C1 Transmit request */
    kDma1RequestLPI2C0Rx            = 11U,         /**< LPI2C0 Receive request */
    kDma0RequestLPI2C0Rx            = 11U,         /**< LPI2C0 Receive request */
    kDma1RequestLPI2C0Tx            = 12U,         /**< LPI2C0 Transmit request */
    kDma0RequestLPI2C0Tx            = 12U,         /**< LPI2C0 Transmit request */
    kDma1RequestLPI2C1Rx            = 13U,         /**< LPI2C1 Receive request */
    kDma0RequestLPI2C1Rx            = 13U,         /**< LPI2C1 Receive request */
    kDma1RequestLPI2C1Tx            = 14U,         /**< LPI2C1 Transmit request */
    kDma0RequestLPI2C1Tx            = 14U,         /**< LPI2C1 Transmit request */
    kDma1RequestLPSPI0Rx            = 15U,         /**< LPSPI0 Receive request */
    kDma0RequestLPSPI0Rx            = 15U,         /**< LPSPI0 Receive request */
    kDma1RequestLPSPI0Tx            = 16U,         /**< LPSPI0 Transmit request */
    kDma0RequestLPSPI0Tx            = 16U,         /**< LPSPI0 Transmit request */
    kDma1RequestLPSPI1Rx            = 17U,         /**< LPSPI1 Receive request */
    kDma0RequestLPSPI1Rx            = 17U,         /**< LPSPI1 Receive request */
    kDma1RequestLPSPI1Tx            = 18U,         /**< LPSPI1 Transmit request */
    kDma0RequestLPSPI1Tx            = 18U,         /**< LPSPI1 Transmit request */
    kDma1RequestLPSPI2Rx            = 19U,         /**< LPSPI2 Receive request */
    kDma0RequestLPSPI2Rx            = 19U,         /**< LPSPI2 Receive request */
    kDma1RequestLPSPI2Tx            = 20U,         /**< LPSPI2 Transmit request */
    kDma0RequestLPSPI2Tx            = 20U,         /**< LPSPI2 Transmit request */
    kDma1RequestLPUART0Rx           = 21U,         /**< LPUART0 Receive request */
    kDma0RequestLPUART0Rx           = 21U,         /**< LPUART0 Receive request */
    kDma1RequestLPUART0Tx           = 22U,         /**< LPUART0 Transmit request */
    kDma0RequestLPUART0Tx           = 22U,         /**< LPUART0 Transmit request */
    kDma1RequestLPUART1Rx           = 23U,         /**< LPUART1 Receive request */
    kDma0RequestLPUART1Rx           = 23U,         /**< LPUART1 Receive request */
    kDma1RequestLPUART1Tx           = 24U,         /**< LPUART1 Transmit request */
    kDma0RequestLPUART1Tx           = 24U,         /**< LPUART1 Transmit request */
    kDma1RequestLPUART2Rx           = 25U,         /**< LPUART2 Receive request */
    kDma0RequestLPUART2Rx           = 25U,         /**< LPUART2 Receive request */
    kDma1RequestLPUART2Tx           = 26U,         /**< LPUART2 Transmit request */
    kDma0RequestLPUART2Tx           = 26U,         /**< LPUART2 Transmit request */
    kDma1RequestLPUART3Rx           = 27U,         /**< LPUART3 Receive request */
    kDma0RequestLPUART3Rx           = 27U,         /**< LPUART3 Receive request */
    kDma1RequestLPUART3Tx           = 28U,         /**< LPUART3 Transmit request */
    kDma0RequestLPUART3Tx           = 28U,         /**< LPUART3 Transmit request */
    kDma1RequestLPUART4Rx           = 29U,         /**< LPUART4 Receive request */
    kDma0RequestLPUART4Rx           = 29U,         /**< LPUART4 Receive request */
    kDma1RequestLPUART4Tx           = 30U,         /**< LPUART4 Transmit request */
    kDma0RequestLPUART4Tx           = 30U,         /**< LPUART4 Transmit request */
    kDma1RequestMuxCtimer0M0        = 31U,         /**< CTIMER0 Match channel 0 request */
    kDma0RequestMuxCtimer0M0        = 31U,         /**< CTIMER0 Match channel 0 request */
    kDma1RequestMuxCtimer0M1        = 32U,         /**< CTIMER0 Match channel 1 request */
    kDma0RequestMuxCtimer0M1        = 32U,         /**< CTIMER0 Match channel 1 request */
    kDma1RequestMuxCtimer1M0        = 33U,         /**< CTIMER1 Match channel 0 request */
    kDma0RequestMuxCtimer1M0        = 33U,         /**< CTIMER1 Match channel 0 request */
    kDma1RequestMuxCtimer1M1        = 34U,         /**< CTIMER1 Match channel 1 request */
    kDma0RequestMuxCtimer1M1        = 34U,         /**< CTIMER1 Match channel 1 request */
    kDma1RequestMuxCtimer2M0        = 35U,         /**< CTIMER2 Match channel 0 request */
    kDma0RequestMuxCtimer2M0        = 35U,         /**< CTIMER2 Match channel 0 request */
    kDma1RequestMuxCtimer2M1        = 36U,         /**< CTIMER2 Match channel 1 request */
    kDma0RequestMuxCtimer2M1        = 36U,         /**< CTIMER2 Match channel 1 request */
    kDma1RequestMuxCtimer3M0        = 37U,         /**< CTIMER3 Match channel 0 request */
    kDma0RequestMuxCtimer3M0        = 37U,         /**< CTIMER3 Match channel 0 request */
    kDma1RequestMuxCtimer3M1        = 38U,         /**< CTIMER3 Match channel 1 request */
    kDma0RequestMuxCtimer3M1        = 38U,         /**< CTIMER3 Match channel 1 request */
    kDma1RequestMuxCtimer4M0        = 39U,         /**< CTIMER4 Match channel 0 request */
    kDma0RequestMuxCtimer4M0        = 39U,         /**< CTIMER4 Match channel 0 request */
    kDma1RequestMuxCtimer4M1        = 40U,         /**< CTIMER4 Match channel 1 request */
    kDma0RequestMuxCtimer4M1        = 40U,         /**< CTIMER4 Match channel 1 request */
    kDma1RequestMuxLptmr0           = 49U,         /**< LPTMR0 Counter match event */
    kDma0RequestMuxLptmr0           = 49U,         /**< LPTMR0 Counter match event */
    kDma1RequestMuxAdc0FifoRequest  = 51U,         /**< ADC0 FIFO request */
    kDma0RequestMuxAdc0FifoRequest  = 51U,         /**< ADC0 FIFO request */
    kDma1RequestMuxAdc1FifoRequest  = 52U,         /**< ADC1 FIFO request */
    kDma0RequestMuxAdc1FifoRequest  = 52U,         /**< ADC1 FIFO request */
    kDma1RequestMuxHsCmp0DmaRequest = 53U,         /**< CMP0 DMA_request */
    kDma0RequestMuxHsCmp0DmaRequest = 53U,         /**< CMP0 DMA_request */
    kDma1RequestMuxHsCmp1DmaRequest = 54U,         /**< CMP1 DMA_request */
    kDma0RequestMuxHsCmp1DmaRequest = 54U,         /**< CMP1 DMA_request */
    kDma1RequestMuxHsCmp2DmaRequest = 55U,         /**< CMP2 DMA_request */
    kDma0RequestMuxHsCmp2DmaRequest = 55U,         /**< CMP2 DMA_request */
    kDma1RequestMuxDac0FifoRequest  = 56U,         /**< DAC0 FIFO request */
    kDma0RequestMuxDac0FifoRequest  = 56U,         /**< DAC0 FIFO request */
    kDma1RequestMuxDac1FifoRequest  = 57U,         /**< DAC1 FIFO request */
    kDma0RequestMuxDac1FifoRequest  = 57U,         /**< DAC1 FIFO request */
    kDma1RequestMuxGpio5PinEventRequest0 = 59U,    /**< GPIO5 Pin event request 0 */
    kDma0RequestMuxGpio5PinEventRequest0 = 59U,    /**< GPIO5 Pin event request 0 */
    kDma1RequestMuxGpio0PinEventRequest0 = 60U,    /**< GPIO0 Pin event request 0 */
    kDma0RequestMuxGpio0PinEventRequest0 = 60U,    /**< GPIO0 Pin event request 0 */
    kDma1RequestMuxGpio1PinEventRequest0 = 61U,    /**< GPIO1 Pin event request 0 */
    kDma0RequestMuxGpio1PinEventRequest0 = 61U,    /**< GPIO1 Pin event request 0 */
    kDma1RequestMuxGpio2PinEventRequest0 = 62U,    /**< GPIO2 Pin event request 0 */
    kDma0RequestMuxGpio2PinEventRequest0 = 62U,    /**< GPIO2 Pin event request 0 */
    kDma1RequestMuxGpio3PinEventRequest0 = 63U,    /**< GPIO3 Pin event request 0 */
    kDma0RequestMuxGpio3PinEventRequest0 = 63U,    /**< GPIO3 Pin event request 0 */
    kDma1RequestMuxGpio4PinEventRequest0 = 64U,    /**< GPIO4 Pin event request 0 */
    kDma0RequestMuxGpio4PinEventRequest0 = 64U,    /**< GPIO4 Pin event request 0 */
    kDma1RequestMuxTsi0EndOfScan    = 69U,         /**< TSI0 End of Scan */
    kDma0RequestMuxTsi0EndOfScan    = 69U,         /**< TSI0 End of Scan */
    kDma1RequestMuxTsi0OutOfRange   = 70U,         /**< TSI0 Out of Range */
    kDma0RequestMuxTsi0OutOfRange   = 70U,         /**< TSI0 Out of Range */
    kDma1RequestMuxFlexIO0ShiftRegister0Request = 71U, /**< FlexIO0 Shifter0 Status DMA request OR Timer0 Status DMA request */
    kDma0RequestMuxFlexIO0ShiftRegister0Request = 71U, /**< FlexIO0 Shifter0 Status DMA request OR Timer0 Status DMA request */
    kDma1RequestMuxFlexIO0ShiftRegister1Request = 72U, /**< FlexIO0 Shifter1 Status DMA request OR Timer1 Status DMA request */
    kDma0RequestMuxFlexIO0ShiftRegister1Request = 72U, /**< FlexIO0 Shifter1 Status DMA request OR Timer1 Status DMA request */
    kDma1RequestMuxFlexIO0ShiftRegister2Request = 73U, /**< FlexIO0 Shifter2 Status DMA request OR Timer2 Status DMA request */
    kDma0RequestMuxFlexIO0ShiftRegister2Request = 73U, /**< FlexIO0 Shifter2 Status DMA request OR Timer2 Status DMA request */
    kDma1RequestMuxFlexIO0ShiftRegister3Request = 74U, /**< FlexIO0 Shifter3 Status DMA request OR Timer3 Status DMA request */
    kDma0RequestMuxFlexIO0ShiftRegister3Request = 74U, /**< FlexIO0 Shifter3 Status DMA request OR Timer3 Status DMA request */
    kDma1RequestMuxFlexCan1DmaRequest = 87U,       /**< CAN1 DMA request */
    kDma0RequestMuxFlexCan1DmaRequest = 87U,       /**< CAN1 DMA request */
    kDma1RequestMuxEspiCh0DmaRequest = 92U,        /**< ESPI CHANNEL0 DMA request */
    kDma0RequestMuxEspiCh0DmaRequest = 92U,        /**< ESPI CHANNEL0 DMA request */
    kDma1RequestMuxEspiCh1DmaRequest = 93U,        /**< ESPI CHANNEL1 DMA request */
    kDma0RequestMuxEspiCh1DmaRequest = 93U,        /**< ESPI CHANNEL1 DMA request */
    kDma1RequestLPI2C4Rx            = 94U,         /**< LPI2C4 Receive request */
    kDma0RequestLPI2C4Rx            = 94U,         /**< LPI2C4 Receive request */
    kDma1RequestLPI2C4Tx            = 95U,         /**< LPI2C4 Transmit request */
    kDma0RequestLPI2C4Tx            = 95U,         /**< LPI2C4 Transmit request */
    kDma1RequestLPSPI3Rx            = 96U,         /**< LPSPI3 Receive request */
    kDma0RequestLPSPI3Rx            = 96U,         /**< LPSPI3 Receive request */
    kDma1RequestLPSPI3Tx            = 97U,         /**< LPSPI3 Transmit request */
    kDma0RequestLPSPI3Tx            = 97U,         /**< LPSPI3 Transmit request */
    kDma1RequestLPSPI4Rx            = 98U,         /**< LPSPI4 Receive request */
    kDma0RequestLPSPI4Rx            = 98U,         /**< LPSPI4 Receive request */
    kDma1RequestLPSPI4Tx            = 99U,         /**< LPSPI4 Transmit request */
    kDma0RequestLPSPI4Tx            = 99U,         /**< LPSPI4 Transmit request */
    kDma1RequestLPSPI5Rx            = 100U,        /**< LPSPI5 Receive request */
    kDma0RequestLPSPI5Rx            = 100U,        /**< LPSPI5 Receive request */
    kDma1RequestLPSPI5Tx            = 101U,        /**< LPSPI5 Transmit request */
    kDma0RequestLPSPI5Tx            = 101U,        /**< LPSPI5 Transmit request */
    kDma1RequestLPUART5Rx           = 102U,        /**< LPUART5 Receive request */
    kDma0RequestLPUART5Rx           = 102U,        /**< LPUART5 Receive request */
    kDma1RequestLPUART5Tx           = 103U,        /**< LPUART5 Transmit request */
    kDma0RequestLPUART5Tx           = 103U,        /**< LPUART5 Transmit request */
    kDma1RequestMuxI3c2Rx           = 106U,        /**< I3C2 Receive request */
    kDma0RequestMuxI3c2Rx           = 106U,        /**< I3C2 Receive request */
    kDma1RequestMuxI3c2Tx           = 107U,        /**< I3C2 Transmit request */
    kDma0RequestMuxI3c2Tx           = 107U,        /**< I3C2 Transmit request */
    kDma1RequestMuxI3c3Rx           = 108U,        /**< I3C3 Receive request */
    kDma0RequestMuxI3c3Rx           = 108U,        /**< I3C3 Receive request */
    kDma1RequestMuxI3c3Tx           = 109U,        /**< I3C3 Transmit request */
    kDma0RequestMuxI3c3Tx           = 109U,        /**< I3C3 Transmit request */
    kDma1RequestMuxFlexSpi0Rx       = 110U,        /**< FlexSPI0 Receive event */
    kDma0RequestMuxFlexSpi0Rx       = 110U,        /**< FlexSPI0 Receive event */
    kDma1RequestMuxFlexSpi0Tx       = 111U,        /**< FlexSPI0 Transmit event */
    kDma0RequestMuxFlexSpi0Tx       = 111U,        /**< FlexSPI0 Transmit event */
    kDma1RequestMuxItrcTmpr         = 117U,        /**< ITRC TMPR output */
    kDma0RequestMuxItrcTmpr         = 117U,        /**< ITRC TMPR output */
    kDma1RequestSGI0Datain          = 119U,        /**< SGI0 DATAIN request */
    kDma0RequestSGI0Datain          = 119U,        /**< SGI0 DATAIN request */
    kDma1RequestSGI0Dataout         = 120U,        /**< SGI0 DATOUT request */
    kDma0RequestSGI0Dataout         = 120U,        /**< SGI0 DATOUT request */
} dma_request_source_t;

/* @} */
#endif /* DMA_REQUEST_SOURCE_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


